<template>
  <HeaderForm :buttonText="loginButtonText" @buttonClick="goToLogin" />
  <main>
    <aside class="sidebar">
      <div class="sidebar-container">
        <ul>
          <li><a href="#purpose">Назначение </a></li>
          <li> <a href="#methodological_base"> Методическая база</a> </li>
          <li> <a href="#scope_application"> Область применения </a> </li>
          <li> <a href="#composition_and_structure"> Состав и структура </a> </li>
          <li> <a href="#peculiarities"> Особенности программной реализации </a> </li>
          <li> <a href="#example"> Демонстрационный пример  </a> </li>
        </ul>
      </div>
    </aside>
    <div class="main-content">
      <h1 id="purpose">Назначение ЭО ПМ СППР «Программа многокритериального анализа экспертных знаний для принятия управленческих решений» </h1>
      <p> ЭО ПМ СППР представляет собой программное средство для автоматизации процесса принятия управленческих решений на основе
        многокритериального анализа явных и неявных знаний, полученных по результатам проведения опроса экспертов.
        ЭО ПМ СППР предназначен для повышения степени обоснованности проектных решений по разработке информационных технологий
        управления жизненным циклом существующих и перспективных интегрированных государственных и коммерческих информационно-управляющих и телекоммуникационных
        систем и сетей на основе на основе многокритериального оценивания различных вариантов решения целевых задач СлО.
      </p>
      <h1 id="methodological_base"> Научно-методологическая и методическая база создания ЭО ПМ СППР «Программа многокритериального анализа экспертных знаний для принятия управленческих решений»</h1>
      <p> В качестве основных методов анализа в ЭО ПМ СППР был использован комбинированный подход на основе применения нечеткой логики и методов теории планирования эксперимента.
        Процесс многокритериального анализа экспертных знаний для принятия управленческих решений в общем случае включает:
      </p>
      <ul>
        <li> формирование лингвистических шкал для каждого показателя качества функционирования СлО; </li>
        <li> формирование результирующего показателя качества функционирования СлО; </li>
        <li> формирование экспертного опроса на основе логико-продукционных правил вида «ЕСЛИ-ТО»; </li>
        <li> проведение опроса экспертов; </li>
        <li> вычисление коэффициентов в свертке частных показателей качества (формализация одиночного и группового влияние показателей качества на значение результирующего показателя качества); </li>
        <li> с учётом уровня компетентности экспертов формируется нечетко-возможностный полином.</li>
      </ul>

      <p> Применение нечетко-возможностного подхода и методов теории планирования экспериментапозволяет формулировать вопросы на интуитивно
        понятном эксперту языке. В тоже время программная реализация положенный в основу ЭО ПМ СППР методики многокритериального оценивания,
        которая была разработана в рамках исследований Спесивцева А.В., Павлова А.Н., Павлова Д.А., Захарова В.В., на уровне практической реализации обеспечивает
        возможность учета как неопределенности экспертных знаний, так и влияния множества взаимосвязанных критериев общей эффективности  функционирования СлО на результирующий
        показатель качества на различных стадиях жизненного цикла.
        В отличие от традиционно используемых многошаговых, итерационных эвристических процедур назначения весов соответствующим критериальным функциям,
        веса показателей качества в рамках предложенного подхода формируются автоматически на основе предварительно проведенного экспертного опроса, что в дальнейшем
        обеспечивает более гибким и адаптированным к реальным условиям.
      </p>

      <p> В отличие от традиционно используемых многошаговых, итерационных эвристических процедур назначения весов соответствующим критериальным функциям, веса показателей
        качества в рамках предложенного подхода формируются
        автоматически на основе предварительно проведенного экспертного опроса, что в дальнейшем обеспечивает более гибким и адаптированным к реальным условиям.
      </p>

      <h1 id="scope_application"> Область применения ЭО ПМ СППР </h1>

      <p> ЭО ПМ СППР применим на различных этапах жизненного цикла СлО – от выбора наиболее предпочтительного варианта при проектировании (приобретении, модернизации)
        объекта до ранжирования программ функционирования гетерогенных элементов и подсистем в различных условиях внутренних и внешних возмущающих воздействий.
        Результатом многокритериального анализа экспертных знаний является нечетко-возможностный полином,
        который может быть использован для автономного принятия решений как отдельными активными объектами, так и для принятия общесистемных решений.
      </p>

      <p> Отличительные черты ЭО ПМ СППР: </p>
      <ol>
        <li> Развиваемость </li>
        <li> Экономичность</li>
        <li> Дружественный интерфейс </li>
        <li> Естественность входного языка </li>
        <li> Удобство графика вывод </li>
        <li> Раздельное создание и хранение модели предметной области (ПрО) и модели предпочтений ЛПР (хранение полинома) </li>
        <li> Реконфигурируемость системы по отношению к решаемым задачам </li>
      </ol>

      <p> В совокупности перечисленные особенности ЭО ПМ СППР позволяют, во-первых, оперативно формировать модель (опрос ЛПР),
        а во-вторых, сократить время на расчёт полинома. ЭО ПМ СППР может быть встроен в специализированные
        программные системы в роли блока принятия решений.
      </p>

      <h1 id="composition_and_structure"> Состав и структура ЭО ПМ СППР </h1>
      <p> Состав и структура ЭО ПМ СППР «Программа многокритериального анализа экспертных знаний
        для принятия управленческих решений» представлена в виде следующей схемы (рисунок 1.2.1). </p>

      <img src="../assets/pages/Composition_and_structure.jpg" alt="">
      <p style="font-size:15px;"> Рисунок 1.2.1 — Состав и структура ЭО ПМ СППР </p>

      <p>
        Сценарии функционирования ЭО ПМ СППР в общем случае сводятся к формированию и решению задач принятия управленческих решений,
        с последующем анализом результатов.
        ЭО ПМ СППР работает по принципу клиент-серверного взаимодействия, обмениваясь JSON-запросами
        и ответами для решения задач многокритериального анализа экспертных знаний для принятия управленческих решений.
      </p>

      <p> Исходными данными для работы ЭО ПМ СППР являются: </p>
      <ol>
        <li> Система показателей качества функционирования СлО </li>
        <li> Лингвистические шкалы результирующего и частных показателей качества функционирования СлО </li>
        <li> Продукционные правила, на основе которых формируются вопросы для ЛПР  </li>
        <li> Уровни компетентности экспертов </li>
        <li> Результаты экспертного опроса </li>
      </ol>

      <p> Выходными данными ЭО ПМ СППР являются:  </p>
      <ol>
        <li> Нечетко-возможностный полином, отражающий модель предметной области каждого эксперта </li>
        <li> Нечетко-возможностный полином, отражающий модель группового представления предметной области</li>
      </ol>

      <h1 id="peculiarities"> Особенности программной реализации </h1>
      <p> Программная реализация разработанного ЭО ПМ СППР представляет собой веб-приложение с серверной частью, реализованной
        на Django REST Framework (DRF), и клиентской частью, разработанной с
        использованием Vue.js. Архитектура построена на основе клиент-серверного взаимодействия, где данные передаются в формате JSON.
      </p>

      <p>
        Серверная часть использует язык программирования Python 3.x и свободно распространяемые математические библиотеки,
        что обеспечивает независимость от конкретной операционной системы и аппаратной платформы. О
        пределенные ограничения на ОС (Windows, Mac OS, Linux) могут накладываться только при использовании специфических библиотек,
        таких как Sympy. Основная часть функциональных возможностей реализована на «чистом» Python, что позволяет избежать дополнительных ограничений.
      </p>

      <h1 id="example"> Демонстрационный пример практической реализации ЭО ПМ СППР </h1>
      <p> В демонстрационном примере практической реализации ЭО ПМ СППР рассмотрена задача многокритериального анализа экспертных
        знаний для принятия управленческих решений о выборе способа проведения
        модернизации орбитальной группировки малоразмерных космических аппаратов дистанционного зондирования Земли (ОГ МКА ДЗЗ).
      </p>

      <p> Модельер (он же ЛПР) должен провести анализ качества функционирования космической системы (обработки и передачи данных потребителю)
        по показателям «Объем доставленных данных», «Объем обработанных данных», «Потери данных и информации» на основе многовариантного
        планирования (моделирования). Для этого решается задача объемно-календарного планирования и синтеза расписаний
        (с помощью статической и динамической модели соответственно)
        для различных вариантов технической структуры ОГ МКА ДЗЗ (технико-технологические характеристик ОГ МКА ДЗЗ).
      </p>
      <p>
        На первом этапе (см. рис. 1.2.2.) модельер формирует:
      </p>
      <ol>
        <li> Систему показателей качества, которая состоит из трех показателей, (приведены выше).  </li>
        <li> Лингвистические шкалы для частных и результирующего показателей качества. </li>
        <li> В автоматическом режиме формируется экспертный опрос, в основе которого лежит логико-продукционные правил вида «ЕСЛИ-ТО». </li>
      </ol>

      <img src="../assets/pages/settings_expconv.jpg" alt="">
      <p style="font-size:15px;"> Рисунок 1.2.2 — Настройки экспертного опроса ЛПР </p>

      <p> На втором этапе модельер определяет состав экспертной группы для проведения опроса.
        В рамках данного процесса вводятся условные обозначения для участников процедуры оценивания,
        а также задаются коэффициенты уровня компетентности экспертов. При этом учитывается условие нормировки:
        ∑_(i=1)^n▒〖K_i=1 〗, где n- количество экспертов, K_i- коэффициент компетентности эксперта (см. рисунок 1.2.3).
      </p>

      <img src="../assets/pages/entering_the_name_of_the_odds_expert.jpg" alt="">
      <p style="font-size:15px;"> Рисунок 1.2.3 — Окно ввода имени эксперта и назначения коэффициентов компетентности </p>

      <p> На третьем этапе эксперты отвечают на вопросы (см. рисунок 1.2.4) </p>
      <img src="../assets/pages/questions_answers.jpg" alt="">
      <p style="font-size:15px;"> Рисунок 1.2.4 — Окно ввода ответов на вопросы, сформированные на основе опорных ситуаций </p>

      <p>
        На четвертом этапе формируются нечетко-возможностные полиномы, которые были получены по результатам ответа каждого эксперта, в сущности,
        они представляют модель принятия управленческих решений соответствующего специалиста, сохраняются в базу данных.
      </p>

      <p>
        На пятом этапе формируется нечетко-возможностный
        полином (модель группового принятия решений) с учетом уровней компетентности экспертов. Результаты сохраняются в базу данных.
      </p>

      <img src="../assets/pages/resulting_convolution.jpg" alt="">
      <p style="font-size:15px;"> Рисунок 1.2.4 — Полученная свёртка показателей после экспертного опроса и её частная оценка </p>

      <p>
        На шестом этапе модельер переводит значения частных показателей качества
        (получены из внешнего модуля по результатам решения задач планирования с помощью статической и динамической моделей) в
        шкалу [-1,1] для вычисления результирующего
        показателя качества функционирования ОГ МКА ДЗЗ на рассматриваемом этапе модернизации при заданной технической структуре
      </p>


    </div>
  </main>

</template>

<script>
import HeaderForm from "./NavigationsComponents/HeaderForm.vue";
export default {
  components: {HeaderForm},
  data(){
    return{
      loginButtonText: 'Войти',
    };
  },
  methods: {
    goToLogin(){
      this.$router.push('/login');
    }
  }
}

</script>

<style scoped>

main{
  margin: 100px 10px 10px 10px;
  display: flex;
}

.sidebar{
  font-size: 20px;
  margin-right: 10px;
  background-color: #023051;
  width: 200px;
  height: 400px;
  border-radius: 10px;

}
.sidebar-container ul {
  padding: 10px;
  list-style: none;
}
.sidebar-container ul li {
  margin: 10px auto 10px auto;
}
.sidebar-container a {
  color: white;
  text-decoration: none;
}

.sidebar-container a:hover {
  text-decoration: underline;
  text-decoration-color: whitesmoke;
}

.main-content{
  font-size: 30px;
  font-family: Times New Roman, serif;
  padding: 10px;
  width: calc(100% - 40px);
  text-align: center;
}

h1{
  font-size: 30px;
}
</style>